# =============================================================================
# Homebrew Casks (Optional GUI Applications)
#
# This file is intentionally separate from Brewfile. Fresh bootstrap should not
# fail just because one GUI app is temporarily unavailable or renamed upstream.
# =============================================================================

# --- Password & Security ---
cask "1password"
cask "1password-cli"

# --- Launcher & Productivity ---
cask "alfred"
cask "devtoys"
cask "stats"

# --- Terminal ---
cask "ghostty"

# --- Editors & IDE ---
cask "cursor"
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "zed"

# --- AI Applications ---
cask "chatgpt"
cask "claude"
cask "codex-app"
cask "codexbar"
cask "lm-studio"
cask "ollama-app"

# --- Browsers ---
cask "firefox@developer-edition"
cask "google-chrome"
cask "microsoft-edge"

# --- Communication ---
cask "discord"
cask "slack"
cask "telegram"
cask "zoom"

# --- Database & API ---
cask "dbeaver-community"
cask "postman"

# --- Git UI ---
cask "sourcetree"

# --- Development Tools ---
cask "docker-desktop"
cask "termius"
cask "utm"

# --- Notes & Documentation ---
cask "heynote"
cask "obsidian"
cask "pdf-expert"
cask "ridibooks"

# --- Remote Access ---
cask "anydesk"

# --- Cloud Storage ---
cask "google-drive"
cask "onedrive"

# --- Microsoft Office ---
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"

# --- Media ---
cask "movist-pro"

# --- Translation ---
cask "deepl"

# --- Input & Peripherals ---
cask "karabiner-elements"
cask "logitech-options"

# --- Fonts ---
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-google-sans-code"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
