tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mdogan/zulu"
tap "mongodb/brew"
brew "apr-util"
brew "bat"
brew "coreutils"
brew "dive"
brew "duf"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "gping"
brew "gradle"
brew "htop"
brew "httpie"
brew "jq"
brew "jython"
brew "kotlin"
brew "mas"
brew "maven"
brew "neofetch"
brew "neovim"
brew "nginx"
brew "nvm"
brew "procs"
brew "putty"
brew "pyenv"
brew "redis"
brew "subversion"
brew "telnet"
brew "tldr"
brew "tmux"
brew "wget"
brew "zsh"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "alt-tab"
cask "anydesk"
cask "aws-vpn-client"
cask "bettertouchtool"
cask "dbeaver-community"
cask "deepl"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox-developer-edition"
cask "flux"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "forklift"
cask "google-chrome"
cask "heynote"
cask "istat-menus"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "kubernetic"
cask "logitech-options"
cask "macs-fan-control"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-teams"
cask "mounty"
cask "namechanger"
cask "ngrok"
cask "onedrive"
cask "pdf-expert"
cask "postman"
cask "ridibooks"
cask "slack"
cask "smartsvn"
cask "sourcetree"
cask "teamviewer"
cask "termius"
cask "visual-studio-code"
cask "wireshark"
cask "zeplin"
cask "zoom"
cask "zulu"
mas "1Password for Safari", id: 1569813296
mas "Cleaner One", id: 1473079126
mas "DayGram", id: 977949232
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PhotoScape X", id: 929507092
mas "PopClip", id: 445189367
mas "반디집", id: 1265704574
mas "유니콘", id: 1231935892
mas "유니콘 HTTPS", id: 1475628500
mas "카카오톡", id: 869223134
vscode "akamud.vscode-theme-onedark"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "isudox.vscode-jetbrains-keybindings"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ko"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "techer.open-in-browser"
vscode "vincaslt.highlight-matching-tag"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
